[
  {
    "id": "ex-004",
    "title": "The Melody That Lifts Me Up",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Translate a passage about the power of music",
    "sourceText": "Hôm nay, tôi lại nghe bài hát yêu thích của mình. Mỗi lần nghe, tôi đều cảm thấy tâm trạng tốt hơn. Âm nhạc thật sự có sức mạnh kỳ diệu. Nó có thể khiến tôi vui vẻ hoặc buồn bã. Hôm nay, tôi cảm thấy thật hạnh phúc. Tôi nhớ lại những kỷ niệm đẹp đẽ. Tôi nghĩ về những người bạn cũ thân thiết. Tôi cảm thấy biết ơn vì đã có những trải nghiệm quý giá đó. Âm nhạc là một phần không thể thiếu trong cuộc sống của tôi.",
    "englishText": "Today, I listened to my favorite song again. Every time I listen, I feel better. Music truly has a magical power. It can make me happy or sad. Today, I feel really happy. I recall beautiful memories. I think about old close friends. I feel grateful for having had those precious experiences. Music is an indispensable part of my life.",
    "highlightedSentences": [
      "Music has a magical power"
    ],
    "hints": [
      "Use the correct article before 'magical power'",
      "Consider singular vs. plural forms"
    ],
    "expectedKeywords": [
      "music",
      "has",
      "magical",
      "power"
    ]
  },
  {
    "id": "ex-030",
    "title": "Cultural Diversity and Unity",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Appreciate different cultures",
    "sourceText": "Thế giới của chúng ta vô cùng đa dạng. Mỗi nền văn hóa đều có những truyền thống riêng biệt. Chúng ta nói những ngôn ngữ khác nhau. Chúng ta thưởng thức những món ăn khác nhau. Chúng ta mặc những trang phục đặc trưng khác nhau. Nhưng tất cả chúng ta đều là con người. Chúng ta có những giá trị cốt lõi chung. Chúng ta đều khao khát hạnh phúc và hòa bình. Sự đa dạng văn hóa làm cho thế giới trở nên phong phú và thú vị hơn. Chúng ta nên tôn trọng và học hỏi lẫn nhau.",
    "englishText": "Our world is extremely diverse. Each culture has its own unique traditions. We speak different languages. We enjoy different foods. We wear different distinctive clothing. But we are all human beings. We have common core values. We all desire happiness and peace. Cultural diversity makes the world richer and more interesting. We should respect and learn from each other.",
    "highlightedSentences": [
      "Our world is very diverse"
    ],
    "hints": [
      "Use 'is' for singular subject",
      "Consider the correct adjective"
    ],
    "expectedKeywords": [
      "world",
      "is",
      "very",
      "diverse"
    ]
  },
  {
    "id": "ex-034",
    "title": "The Art of Storytelling",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Explore narrative techniques",
    "sourceText": "Kể chuyện là một nghệ thuật lâu đời. Từ thời xa xưa, con người đã biết kể chuyện. Chúng ta kể chuyện để vừa giải trí vừa giáo dục. Chúng ta truyền tải giá trị và truyền thống qua những câu chuyện. Một câu chuyện hay phải có nhân vật sinh động thú vị. Nó phải có cốt truyện hấp dẫn lôi cuốn. Nó phải gợi lên những cảm xúc sâu sắc. Văn học phản ánh chân thực xã hội và văn hóa. Nó giúp chúng ta thấu hiểu trải nghiệm của con người. Đọc và viết làm phong phú thêm cuộc sống của chúng ta.",
    "englishText": "Storytelling is an ancient art. Since ancient times, humans have known how to tell stories. We tell stories to both entertain and educate. We convey values and traditions through stories. A good story must have vivid and interesting characters. It must have an engaging and captivating plot. It must evoke deep emotions. Literature authentically reflects society and culture. It helps us understand human experiences. Reading and writing enrich our lives.",
    "highlightedSentences": [
      "Storytelling is an ancient art"
    ],
    "hints": [
      "Use 'is' with singular subject",
      "Consider the article before 'ancient art'"
    ],
    "expectedKeywords": [
      "storytelling",
      "is",
      "an",
      "ancient",
      "art"
    ]
  },
  {
    "id": "ex-078",
    "title": "Museum Visit",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Describe cultural experience",
    "sourceText": "Tuần trước, tôi đã đến thăm một bảo tàng nghệ thuật. Tôi được chiêm ngưỡng nhiều bức tranh và tác phẩm điêu khắc tuyệt đẹp. Hướng dẫn viên giải thích rất chi tiết về lịch sử và ý nghĩa của từng tác phẩm. Tôi đặc biệt ấn tượng với bộ sưu tập nghệ thuật đương đại. Tôi đã chụp lại một số tác phẩm làm kỷ niệm. Đó thực sự là một trải nghiệm vừa giáo dục vừa truyền cảm hứng.",
    "englishText": "Last week, I visited an art museum. I admired many beautiful paintings and sculptures. The guide explained in great detail about the history and meaning of each work. I was particularly impressed with the contemporary art collection. I photographed some works as souvenirs. It was truly both an educational and inspiring experience.",
    "highlightedSentences": [
      "Last week, I visited an art museum"
    ],
    "hints": [
      "Use past tense for completed action"
    ],
    "expectedKeywords": [
      "last",
      "week",
      "visited",
      "art",
      "museum"
    ]
  },
  {
    "id": "ex-079",
    "title": "Music Concert",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Share concert experience",
    "sourceText": "Tối qua, tôi đã đi xem buổi hòa nhạc. Ban nhạc yêu thích của tôi đã có màn trình diễn tuyệt vời. Không khí vô cùng sôi động và tràn đầy năng lượng. Mọi người đều hát theo và nhảy múa cuồng nhiệt. Hệ thống âm thanh và ánh sáng rất ấn tượng và chuyên nghiệp. Đó thực sự là một đêm không thể nào quên. Tôi rất mong được đi xem buổi hòa nhạc khác trong thời gian tới.",
    "englishText": "Last night, I went to a concert. My favorite band gave an amazing performance. The atmosphere was extremely lively and full of energy. Everyone sang along and danced enthusiastically. The sound and lighting system was very impressive and professional. It was truly an unforgettable night. I really look forward to attending another concert soon.",
    "highlightedSentences": [
      "Last night, I went to a concert"
    ],
    "hints": [
      "Use past tense for past event"
    ],
    "expectedKeywords": [
      "last",
      "night",
      "went",
      "to",
      "concert"
    ]
  },
  {
    "id": "ex-180",
    "title": "Traditional Festival Celebration",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Describe cultural event",
    "sourceText": "Lễ hội truyền thống là dịp để cộng đồng sum họp và gắn kết. Mọi người mặc trang phục dân tộc rực rỡ sắc màu. Có nhiều hoạt động văn hóa như hát dân ca, múa truyền thống và trình diễn nghệ thuật. Trẻ em chơi các trò chơi dân gian vui nhộn như kéo co, đánh đu và bịt mắt bắt dê. Lễ hội không chỉ mang lại niềm vui mà còn giúp bảo tồn và phát huy bản sắc văn hóa dân tộc.",
    "englishText": "Traditional festivals are occasions for the community to gather and bond. People wear colorful ethnic costumes. There are many cultural activities such as folk singing, traditional dancing, and art performances. Children play fun folk games like tug of war, swinging, and blindfolded goat catching. Festivals not only bring joy but also help preserve and promote national cultural identity.",
    "highlightedSentences": [
      "Traditional festivals bring the community together"
    ],
    "hints": [
      "Use present simple for general truth",
      "Consider 'bring together' phrasal verb"
    ],
    "expectedKeywords": [
      "traditional",
      "festivals",
      "bring",
      "community",
      "together"
    ]
  },
  {
    "id": "ex-181",
    "title": "Contemporary Art Exhibition",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Describe art show",
    "sourceText": "Tuần trước tôi tham quan triển lãm nghệ thuật đương đại tại bảo tàng mỹ thuật. Các tác phẩm rất đa dạng từ hội họa, điêu khắc đến nghệ thuật sắp đặt. Nghệ sĩ sử dụng nhiều chất liệu và kỹ thuật khác nhau để thể hiện ý tưởng sáng tạo. Mỗi tác phẩm đều mang thông điệp sâu sắc về xã hội, môi trường và con người. Triển lãm đã mở rộng tầm nhìn nghệ thuật và khơi dậy cảm hứng sáng tạo của tôi.",
    "englishText": "Last week I visited a contemporary art exhibition at the fine arts museum. The works were very diverse from painting, sculpture to installation art. Artists used many different materials and techniques to express creative ideas. Each work carried profound messages about society, environment, and humanity. The exhibition broadened my artistic vision and sparked my creative inspiration.",
    "highlightedSentences": [
      "I visited a contemporary art exhibition last week"
    ],
    "hints": [
      "Use past simple for completed action",
      "Consider article before 'exhibition'"
    ],
    "expectedKeywords": [
      "visited",
      "contemporary",
      "art",
      "exhibition",
      "last",
      "week"
    ]
  },
  {
    "id": "ex-182",
    "title": "Learning Musical Instrument",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Discuss music education",
    "sourceText": "Tôi đang học chơi piano được sáu tháng rồi. Ban đầu rất khó khăn vì ngón tay chưa quen với các phím đàn. Tôi luyện tập mỗi ngày ít nhất 30 phút để cải thiện kỹ thuật. Giáo viên rất kiên nhẫn và nhiệt tình hướng dẫn từng bước một. Bây giờ tôi đã chơi được vài bài hát đơn giản và đang học những bản nhạc phức tạp hơn. Âm nhạc mang lại niềm vui, sự thư giãn và giúp tôi phát triển sự kiên nhẫn.",
    "englishText": "I have been learning piano for six months now. Initially it was very difficult because my fingers weren't used to the piano keys. I practice at least 30 minutes every day to improve my technique. The teacher is very patient and enthusiastic, guiding me step by step. Now I can play a few simple songs and am learning more complex pieces. Music brings joy, relaxation, and helps me develop patience.",
    "highlightedSentences": [
      "I have been learning piano for six months"
    ],
    "hints": [
      "Use present perfect continuous",
      "Consider 'for' with time period"
    ],
    "expectedKeywords": [
      "have",
      "been",
      "learning",
      "piano",
      "for",
      "six",
      "months"
    ]
  },
  {
    "id": "ex-183",
    "title": "Theater Performance Experience",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Describe stage show",
    "sourceText": "Tối qua tôi xem vở kịch kinh điển tại nhà hát quốc gia. Diễn viên diễn xuất rất xuất sắc, chuyên nghiệp và đầy cảm xúc. Sân khấu được thiết kế công phu với bối cảnh đẹp mắt và hiệu ứng ánh sáng ấn tượng. Câu chuyện cảm động về tình yêu và hy sinh khiến nhiều người rơi nước mắt. Âm nhạc nền và vũ đạo cũng rất xuất sắc. Đó thực sự là một trải nghiệm nghệ thuật đáng nhớ và ý nghĩa.",
    "englishText": "Last night I watched a classic play at the national theater. The actors performed excellently, professionally, and emotionally. The stage was elaborately designed with beautiful scenery and impressive lighting effects. The touching story about love and sacrifice brought many people to tears. The background music and choreography were also excellent. It was truly a memorable and meaningful artistic experience.",
    "highlightedSentences": [
      "I watched a classic play at the national theater last night"
    ],
    "hints": [
      "Use past simple for past event",
      "Consider article before 'play'"
    ],
    "expectedKeywords": [
      "watched",
      "classic",
      "play",
      "at",
      "national",
      "theater"
    ]
  },
  {
    "id": "ex-184",
    "title": "Photography as Art",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Discuss creative pursuit",
    "sourceText": "Nhiếp ảnh đã trở thành đam mê và nghệ thuật của tôi. Tôi thích chụp ảnh phong cảnh thiên nhiên và chân dung con người. Tôi học về ánh sáng, góc độ, composition và kỹ thuật hậu kỳ. Tôi thường dậy sớm để chụp ánh bình minh hoặc chờ đến hoàng hôn để có ánh sáng đẹp nhất. Nhiếp ảnh giúp tôi nhìn thế giới bằng con mắt khác, tinh tế và sâu sắc hơn. Mỗi bức ảnh đều kể một câu chuyện riêng.",
    "englishText": "Photography has become my passion and art. I like photographing natural landscapes and human portraits. I learn about light, angles, composition, and post-processing techniques. I often wake up early to capture the dawn or wait until sunset for the best light. Photography helps me see the world through different eyes, more delicate and profound. Each photo tells its own story.",
    "highlightedSentences": [
      "Photography has become my passion and art"
    ],
    "hints": [
      "Use present perfect for change",
      "Consider possessive adjective"
    ],
    "expectedKeywords": [
      "photography",
      "has",
      "become",
      "my",
      "passion",
      "and",
      "art"
    ]
  },
  {
    "id": "ex-185",
    "title": "International Film Festival",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Describe cinema event",
    "sourceText": "Tôi tham dự liên hoan phim quốc tế lần đầu tiên và rất ấn tượng. Có phim từ nhiều quốc gia với đa dạng thể loại như phim tài liệu, phim ngắn và phim truyện. Tôi xem những bộ phim hay về văn hóa, xã hội và con người từ nhiều góc nhìn khác nhau. Sau mỗi buổi chiếu có phiên thảo luận thú vị với đạo diễn và diễn viên. Liên hoan phim đã mở rộng hiểu biết của tôi về điện ảnh thế giới và nghệ thuật kể chuyện.",
    "englishText": "I attended an international film festival for the first time and was very impressed. There were films from many countries with diverse genres such as documentaries, short films, and feature films. I watched good films about culture, society, and people from many different perspectives. After each screening there were interesting discussions with directors and actors. The film festival expanded my understanding of world cinema and the art of storytelling.",
    "highlightedSentences": [
      "I attended an international film festival for the first time"
    ],
    "hints": [
      "Use past simple for completed action",
      "Consider 'for the first time' phrase"
    ],
    "expectedKeywords": [
      "attended",
      "international",
      "film",
      "festival",
      "for",
      "first",
      "time"
    ]
  },
  {
    "id": "ex-186",
    "title": "Cultural Heritage Preservation",
    "level": "intermediate",
    "category": "culture-arts",
    "description": "Discuss conservation",
    "sourceText": "Bảo tồn di sản văn hóa là trách nhiệm quan trọng của mọi thế hệ. Di tích lịch sử và công trình kiến trúc cổ kể câu chuyện về quá khứ của chúng ta. Chúng ta cần bảo vệ, tu bổ và duy trì các công trình này cho thế hệ tương lai. Giáo dục thế hệ trẻ về giá trị văn hóa và lịch sử rất quan trọng. Di sản văn hóa không chỉ là tài sản vô giá của dân tộc mà còn là di sản chung của nhân loại.",
    "englishText": "Preserving cultural heritage is an important responsibility of every generation. Historical relics and ancient architectural works tell stories about our past. We need to protect, restore, and maintain these works for future generations. Educating the younger generation about cultural and historical values is very important. Cultural heritage is not only a priceless asset of the nation but also a common heritage of humanity.",
    "highlightedSentences": [
      "Preserving cultural heritage is everyone's responsibility"
    ],
    "hints": [
      "Use gerund as subject",
      "Consider possessive form"
    ],
    "expectedKeywords": [
      "preserving",
      "cultural",
      "heritage",
      "is",
      "everyone's",
      "responsibility"
    ]
  }
]
