[
  {
    "id": "ex-003",
    "title": "The Unexpected Lesson of Humility",
    "level": "intermediate",
    "category": "education-work",
    "description": "Translate a reflection on learning from mistakes",
    "sourceText": "Tuần này, tôi đã học được một bài học bất ngờ. Tôi luôn nghĩ mình giỏi toán. Tôi rất tự tin cho đến khi nhận kết quả bài kiểm tra. Tôi chỉ đạt điểm thấp. Tôi cảm thấy vô cùng thất vọng và xấu hổ. Tôi không hiểu tại sao lại như vậy. Rõ ràng là tôi đã học rất chăm chỉ mà. Sau đó, giáo viên gọi tôi ra nói chuyện. Cô ấy giải thích rằng tôi đã không chú ý đến các chi tiết nhỏ. Tôi nhận ra rằng chỉ tự tin thôi là chưa đủ. Tôi cần phải khiêm tốn và cẩn thận hơn nữa.",
    "englishText": "This week, I learned an unexpected lesson. I always thought I was good at math. I was very confident until I received my test results. I only got a low score. I felt extremely disappointed and embarrassed. I didn't understand why this happened. Clearly, I had studied very hard. Later, the teacher called me to talk. She explained that I hadn't paid attention to small details. I realized that confidence alone is not enough. I need to be more humble and careful.",
    "highlightedSentences": [
      "I always thought I was good at math"
    ],
    "hints": [
      "Use past tense for habitual thoughts",
      "Consider the correct verb form for 'to be good at'"
    ],
    "expectedKeywords": [
      "thought",
      "was",
      "good",
      "at"
    ]
  },
  {
    "id": "ex-026",
    "title": "Business Email Etiquette",
    "level": "intermediate",
    "category": "education-work",
    "description": "Write professional correspondence",
    "sourceText": "Kính gửi Ông Nguyễn, Tôi viết email này để thảo luận về dự án mới. Chúng tôi đã xem xét kỹ lưỡng đề xuất của quý công ty. Chúng tôi rất ấn tượng với kế hoạch chi tiết và chuyên nghiệp. Tuy nhiên, chúng tôi có một số thắc mắc về phần ngân sách. Chúng tôi mong muốn được sắp xếp một cuộc họp để thảo luận sâu hơn. Vui lòng cho tôi biết thời gian nào thuận tiện nhất cho ông. Trân trọng, Mai Anh.",
    "englishText": "Dear Mr. Nguyen, I am writing this email to discuss the new project. We have carefully reviewed your company's proposal. We are very impressed with the detailed and professional plan. However, we have some questions about the budget section. We would like to arrange a meeting to discuss further. Please let me know what time is most convenient for you. Best regards, Mai Anh.",
    "highlightedSentences": [
      "We have reviewed your company's proposal"
    ],
    "hints": [
      "Use present perfect for completed action with present relevance",
      "Consider possessive form"
    ],
    "expectedKeywords": [
      "have",
      "reviewed",
      "company's",
      "proposal"
    ]
  },
  {
    "id": "ex-067",
    "title": "Team Collaboration",
    "level": "intermediate",
    "category": "education-work",
    "description": "Discuss teamwork",
    "sourceText": "Dự án hiện tại của tôi đòi hỏi rất nhiều sự phối hợp nhóm. Chúng tôi họp định kỳ mỗi tuần để cập nhật tiến độ. Mỗi thành viên đều có trách nhiệm cụ thể của riêng mình. Chúng tôi sử dụng các công cụ trực tuyến để chia sẻ tài liệu và thông tin. Khi gặp khó khăn, chúng tôi cùng nhau động não tìm giải pháp. Làm việc nhóm hiệu quả đòi hỏi kỹ năng giao tiếp tốt và tinh thần trách nhiệm cao.",
    "englishText": "My current project requires a lot of team collaboration. We meet regularly every week to update progress. Each member has their own specific responsibilities. We use online tools to share documents and information. When facing difficulties, we brainstorm together to find solutions. Effective teamwork requires good communication skills and a high sense of responsibility.",
    "highlightedSentences": [
      "My current project requires a lot of teamwork"
    ],
    "hints": [
      "Use 'requires' with singular subject"
    ],
    "expectedKeywords": [
      "current",
      "project",
      "requires",
      "lot",
      "of",
      "teamwork"
    ]
  },
  {
    "id": "ex-068",
    "title": "Professional Development",
    "level": "intermediate",
    "category": "education-work",
    "description": "Discuss career growth",
    "sourceText": "Tôi tin rằng học tập suốt đời là vô cùng quan trọng cho sự nghiệp. Tôi thường xuyên tham gia các khóa đào tạo và hội thảo chuyên môn. Tôi đọc sách và các bài viết nghiên cứu về lĩnh vực của mình. Tôi luôn chủ động tìm kiếm phản hồi từ đồng nghiệp và cấp quản lý. Tôi đặt ra mục tiêu phát triển bản thân rõ ràng cho mỗi năm. Đầu tư vào bản thân chính là khoản đầu tư sinh lời nhất.",
    "englishText": "I believe that lifelong learning is extremely important for career. I regularly attend training courses and professional seminars. I read books and research articles about my field. I always proactively seek feedback from colleagues and managers. I set clear personal development goals for each year. Investing in yourself is the most profitable investment.",
    "highlightedSentences": [
      "I believe that lifelong learning is important for career"
    ],
    "hints": [
      "Use 'believe that' clause"
    ],
    "expectedKeywords": [
      "believe",
      "that",
      "lifelong",
      "learning",
      "is",
      "important"
    ]
  },
  {
    "id": "ex-173",
    "title": "Career Transition Challenge",
    "level": "intermediate",
    "category": "education-work",
    "description": "Discuss career change",
    "sourceText": "Sau mười năm làm kế toán, tôi quyết định chuyển sang lĩnh vực công nghệ. Tôi đã dành một năm để học lập trình và xây dựng portfolio. Mặc dù thu nhập ban đầu thấp hơn, tôi cảm thấy hạnh phúc hơn vì đang làm điều mình đam mê. Tôi tin rằng không bao giờ là quá muộn để theo đuổi ước mơ. Sự thay đổi này đã mang lại cho tôi động lực mới trong cuộc sống.",
    "englishText": "After ten years in accounting, I decided to switch to the technology field. I spent a year learning programming and building a portfolio. Although the initial income was lower, I feel happier because I'm doing what I'm passionate about. I believe it's never too late to pursue your dreams. This change has brought me new motivation in life.",
    "highlightedSentences": [
      "I decided to switch careers after ten years"
    ],
    "hints": [
      "Use past simple for decision",
      "Consider 'switch careers' phrase"
    ],
    "expectedKeywords": [
      "decided",
      "switch",
      "careers",
      "after",
      "ten",
      "years"
    ]
  },
  {
    "id": "ex-174",
    "title": "Remote Work Adaptation",
    "level": "intermediate",
    "category": "education-work",
    "description": "Describe working from home",
    "sourceText": "Làm việc từ xa đã trở thành xu hướng phổ biến sau đại dịch. Tôi đã thiết lập không gian làm việc riêng tại nhà với bàn ghế ergonomic. Tôi duy trì lịch trình cố định và mặc quần áo chỉnh tề như đi làm. Tôi sử dụng công cụ trực tuyến để giao tiếp hiệu quả với đồng nghiệp. Làm việc từ xa mang lại sự linh hoạt nhưng cũng đòi hỏi kỷ luật tự giác cao.",
    "englishText": "Remote work has become a popular trend after the pandemic. I have set up a dedicated workspace at home with ergonomic furniture. I maintain a fixed schedule and dress professionally as if going to the office. I use online tools to communicate effectively with colleagues. Remote work brings flexibility but also requires high self-discipline.",
    "highlightedSentences": [
      "Remote work has become a popular trend"
    ],
    "hints": [
      "Use present perfect for change",
      "Consider article before 'trend'"
    ],
    "expectedKeywords": [
      "remote",
      "work",
      "has",
      "become",
      "popular",
      "trend"
    ]
  },
  {
    "id": "ex-175",
    "title": "Leadership Development",
    "level": "intermediate",
    "category": "education-work",
    "description": "Discuss management skills",
    "sourceText": "Khi được thăng chức lên vị trí quản lý, tôi nhận ra rằng kỹ năng lãnh đạo cần được học hỏi và rèn luyện. Tôi tham gia các khóa đào tạo về quản lý và đọc nhiều sách về lãnh đạo. Tôi học cách lắng nghe ý kiến của nhân viên và đưa ra quyết định công bằng. Tôi cũng nhận ra tầm quan trọng của việc phát triển đội ngũ và tạo môi trường làm việc tích cực. Lãnh đạo tốt là người biết truyền cảm hứng và tạo động lực cho đội nhóm.",
    "englishText": "When promoted to a management position, I realized that leadership skills must be learned and developed. I attended management training courses and read many books about leadership. I learned to listen to employees' opinions and make fair decisions. I also realized the importance of developing the team and creating a positive work environment. A good leader knows how to inspire and motivate the team.",
    "highlightedSentences": [
      "I realized that leadership skills must be learned"
    ],
    "hints": [
      "Use past simple for realization",
      "Consider passive voice with 'must'"
    ],
    "expectedKeywords": [
      "realized",
      "that",
      "leadership",
      "skills",
      "must",
      "be",
      "learned"
    ]
  },
  {
    "id": "ex-176",
    "title": "Professional Networking",
    "level": "intermediate",
    "category": "education-work",
    "description": "Discuss building connections",
    "sourceText": "Xây dựng mạng lưới quan hệ nghề nghiệp là yếu tố quan trọng cho sự phát triển sự nghiệp. Tôi thường tham dự các sự kiện ngành và hội thảo chuyên môn để gặp gỡ đồng nghiệp. Tôi duy trì liên lạc với các đồng nghiệp cũ thông qua LinkedIn và email. Tôi tham gia các nhóm chuyên môn và đóng góp ý kiến trong các cuộc thảo luận. Networking không chỉ giúp tôi tìm kiếm cơ hội việc làm mà còn mở rộng kiến thức và quan điểm.",
    "englishText": "Building a professional network is an important factor for career development. I often attend industry events and professional seminars to meet colleagues. I maintain contact with former colleagues through LinkedIn and email. I join professional groups and contribute opinions in discussions. Networking not only helps me find job opportunities but also expands knowledge and perspectives.",
    "highlightedSentences": [
      "Building a professional network is important for career development"
    ],
    "hints": [
      "Use gerund as subject",
      "Consider 'for' preposition"
    ],
    "expectedKeywords": [
      "building",
      "professional",
      "network",
      "is",
      "important",
      "for",
      "career"
    ]
  },
  {
    "id": "ex-177",
    "title": "Handling Workplace Conflict",
    "level": "intermediate",
    "category": "education-work",
    "description": "Discuss conflict resolution",
    "sourceText": "Gần đây tôi phải giải quyết một xung đột phức tạp giữa hai thành viên trong nhóm. Họ có quan điểm khác nhau về cách thực hiện dự án và không thể đi đến thỏa thuận. Tôi tổ chức một cuộc họp riêng để lắng nghe ý kiến của cả hai bên một cách khách quan. Tôi giúp họ nhìn nhận vấn đề từ góc độ của nhau và tìm ra điểm chung. Cuối cùng, chúng tôi đạt được một giải pháp thỏa hiệp mà cả hai đều chấp nhận. Kinh nghiệm này dạy tôi rằng giao tiếp cởi mở và sự đồng cảm là chìa khóa để giải quyết xung đột.",
    "englishText": "Recently I had to resolve a complex conflict between two team members. They had different views on how to implement the project and couldn't reach an agreement. I organized a private meeting to listen to both sides' opinions objectively. I helped them see the issue from each other's perspective and find common ground. Finally, we reached a compromise solution that both accepted. This experience taught me that open communication and empathy are key to resolving conflicts.",
    "highlightedSentences": [
      "I had to resolve a conflict between team members recently"
    ],
    "hints": [
      "Use past simple with 'had to'",
      "Consider 'between' preposition"
    ],
    "expectedKeywords": [
      "had",
      "to",
      "resolve",
      "conflict",
      "between",
      "team",
      "members"
    ]
  },
  {
    "id": "ex-178",
    "title": "Continuing Education Journey",
    "level": "intermediate",
    "category": "education-work",
    "description": "Discuss further learning",
    "sourceText": "Tôi quyết định theo học chương trình thạc sĩ trong khi vẫn làm việc toàn thời gian. Đây là một thách thức lớn vì tôi phải cân bằng giữa công việc, học tập và cuộc sống cá nhân. Tôi học vào buổi tối và cuối tuần, thường xuyên phải thức khuya để hoàn thành bài tập và đồ án. Mặc dù mệt mỏi, tôi cảm thấy rất đáng giá vì kiến thức học được có thể áp dụng ngay vào công việc. Bằng thạc sĩ cũng mở ra nhiều cơ hội thăng tiến và phát triển trong sự nghiệp.",
    "englishText": "I decided to pursue a master's degree while still working full-time. This is a big challenge because I have to balance work, study, and personal life. I study in the evenings and on weekends, often staying up late to complete assignments and projects. Although tired, I feel it's very worthwhile because the knowledge learned can be applied immediately to work. A master's degree also opens up many opportunities for advancement and career development.",
    "highlightedSentences": [
      "I decided to pursue a master's degree while working full-time"
    ],
    "hints": [
      "Use past simple for decision",
      "Consider 'while' clause with continuous"
    ],
    "expectedKeywords": [
      "decided",
      "to",
      "pursue",
      "master's",
      "degree",
      "while",
      "working"
    ]
  },
  {
    "id": "ex-179",
    "title": "Job Interview Success",
    "level": "intermediate",
    "category": "education-work",
    "description": "Describe interview experience",
    "sourceText": "Tôi vừa trải qua một cuộc phỏng vấn quan trọng cho vị trí mơ ước. Tôi đã chuẩn bị kỹ lưỡng bằng cách nghiên cứu về công ty và vị trí ứng tuyển. Tôi luyện tập trả lời các câu hỏi phổ biến và chuẩn bị câu hỏi thông minh để hỏi nhà tuyển dụng. Trong buổi phỏng vấn, tôi cố gắng thể hiện sự tự tin, chuyên nghiệp và nhiệt huyết. Tôi đặt câu hỏi về văn hóa công ty và cơ hội phát triển. Tôi hy vọng sẽ nhận được tin tốt lành trong thời gian tới.",
    "englishText": "I just went through an important job interview for my dream position. I prepared thoroughly by researching the company and the position I applied for. I practiced answering common questions and prepared smart questions to ask the recruiter. During the interview, I tried to show confidence, professionalism, and enthusiasm. I asked questions about company culture and development opportunities. I hope to receive good news soon.",
    "highlightedSentences": [
      "I just went through an important job interview"
    ],
    "hints": [
      "Use present perfect with 'just'",
      "Consider 'went through' phrasal verb"
    ],
    "expectedKeywords": [
      "just",
      "went",
      "through",
      "important",
      "job",
      "interview"
    ]
  }
]
