[
  {
    "id": "ex-028",
    "title": "Sustainable Living Practices",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss environmental responsibility",
    "sourceText": "Tôi đang nỗ lực sống bền vững hơn mỗi ngày. Tôi hạn chế tối đa việc sử dụng nhựa dùng một lần. Tôi luôn mang theo túi vải khi đi mua sắm. Tôi phân loại và tái chế giấy, nhựa cũng như kim loại. Tôi tiết kiệm nước và điện một cách có ý thức. Tôi tự trồng rau sạch trong vườn nhà. Tôi đi xe đạp thay vì lái ô tô khi có thể. Những thay đổi nhỏ này tạo ra sự khác biệt lớn. Tôi muốn góp phần bảo vệ hành tinh cho thế hệ mai sau.",
    "highlightedSentences": [
      "I am trying to live more sustainably"
    ],
    "hints": [
      "Use present continuous for ongoing effort",
      "Consider the comparative form of adverb"
    ],
    "expectedKeywords": [
      "am",
      "trying",
      "to",
      "live",
      "more",
      "sustainably"
    ]
  },
  {
    "id": "ex-029",
    "title": "The Digital Revolution",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Explore technological advancement",
    "sourceText": "Công nghệ đã thay đổi hoàn toàn cuộc sống của chúng ta. Chúng ta có thể kết nối với bất kỳ ai trên toàn thế giới. Thông tin được truy cập ngay lập tức chỉ bằng vài cú click. Chúng ta làm việc từ xa và học trực tuyến một cách dễ dàng. Trí tuệ nhân tạo đang phát triển với tốc độ chóng mặt. Tuy nhiên, chúng ta cũng phải đối mặt với nhiều thách thức mới. Chúng ta cần tìm sự cân bằng giữa thế giới công nghệ và cuộc sống thực. Chúng ta phải sử dụng công nghệ một cách có trách nhiệm và có ý thức.",
    "highlightedSentences": [
      "Technology has completely changed our lives"
    ],
    "hints": [
      "Use present perfect for change over time",
      "Consider the adverb placement"
    ],
    "expectedKeywords": [
      "technology",
      "has",
      "completely",
      "changed",
      "lives"
    ]
  },
  {
    "id": "ex-082",
    "title": "Smartphone Technology",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss mobile technology",
    "sourceText": "Điện thoại thông minh đã thay đổi hoàn toàn cách chúng ta sống. Chúng ta sử dụng chúng để giao tiếp, làm việc và giải trí hàng ngày. Chúng ta có thể truy cập mọi thông tin ngay lập tức. Chúng ta có thể chụp ảnh và quay video với chất lượng cực cao. Tuy nhiên, chúng ta cũng cần lưu ý về thời gian nhìn màn hình. Sự cân bằng là vô cùng quan trọng để bảo vệ sức khỏe.",
    "highlightedSentences": [
      "Smartphones have changed the way we live"
    ],
    "hints": [
      "Use present perfect for change over time"
    ],
    "expectedKeywords": [
      "smartphones",
      "have",
      "changed",
      "the",
      "way",
      "we",
      "live"
    ]
  },
  {
    "id": "ex-083",
    "title": "Renewable Energy",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss clean energy",
    "sourceText": "Năng lượng tái tạo đang ngày càng trở nên phổ biến. Năng lượng mặt trời và gió vừa sạch vừa bền vững. Nhiều quốc gia đang đầu tư mạnh mẽ vào công nghệ xanh. Điều này giúp giảm đáng kể lượng khí thải carbon và chống lại biến đổi khí hậu. Tuy nhiên, chúng ta vẫn cần tiếp tục cải thiện công nghệ lưu trữ năng lượng. Tương lai của năng lượng chắc chắn thuộc về năng lượng tái tạo.",
    "highlightedSentences": [
      "Renewable energy is becoming more popular"
    ],
    "hints": [
      "Use present continuous for ongoing trend"
    ],
    "expectedKeywords": [
      "renewable",
      "energy",
      "is",
      "becoming",
      "more",
      "popular"
    ]
  },
  {
    "id": "ex-196",
    "title": "Climate Change Impact",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss global warming",
    "sourceText": "Biến đổi khí hậu đang ảnh hưởng nghiêm trọng đến hành tinh của chúng ta. Nhiệt độ trung bình toàn cầu đã tăng đáng kể trong thế kỷ qua. Băng ở hai cực đang tan chảy với tốc độ đáng báo động. Mực nước biển dâng cao đe dọa các thành phố ven biển. Thời tiết cực đoan như bão, lũ lụt và hạn hán ngày càng thường xuyên. Chúng ta cần hành động ngay lập tức để giảm phát thải khí nhà kính. Tương lai của thế hệ sau phụ thuộc vào những quyết định của chúng ta hôm nay.",
    "highlightedSentences": [
      "Climate change is seriously affecting our planet"
    ],
    "hints": [
      "Use present continuous for ongoing impact",
      "Consider adverb placement"
    ],
    "expectedKeywords": [
      "climate",
      "change",
      "is",
      "seriously",
      "affecting",
      "planet"
    ]
  },
  {
    "id": "ex-197",
    "title": "Artificial Intelligence Revolution",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Explore AI technology",
    "sourceText": "Trí tuệ nhân tạo đang cách mạng hóa nhiều lĩnh vực trong cuộc sống. AI giúp chẩn đoán bệnh chính xác hơn trong y tế. Nó tối ưu hóa sản xuất và logistics trong công nghiệp. AI hỗ trợ giáo dục cá nhân hóa cho từng học sinh. Xe tự lái và robot thông minh đang trở thành hiện thực. Tuy nhiên, chúng ta cũng cần quan tâm đến đạo đức và an toàn AI. Chúng ta phải đảm bảo AI phục vụ lợi ích của nhân loại.",
    "highlightedSentences": [
      "Artificial intelligence is revolutionizing many fields"
    ],
    "hints": [
      "Use present continuous for ongoing change",
      "Consider plural 'fields'"
    ],
    "expectedKeywords": [
      "artificial",
      "intelligence",
      "is",
      "revolutionizing",
      "many",
      "fields"
    ]
  },
  {
    "id": "ex-198",
    "title": "Space Exploration Progress",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss space science",
    "sourceText": "Khám phá vũ trụ đã đạt được nhiều tiến bộ đáng kinh ngạc. Con người đã đặt chân lên Mặt Trăng và gửi tàu thăm dò đến sao Hỏa. Kính viễn vọng không gian giúp chúng ta hiểu rõ hơn về vũ trụ. Các công ty tư nhân đang phát triển du lịch vũ trụ thương mại. Chúng ta đang tìm kiếm sự sống ngoài Trái Đất. Khám phá vũ trụ không chỉ thỏa mãn tò mò mà còn mang lại công nghệ mới. Tương lai của nhân loại có thể nằm ở những ngôi sao.",
    "highlightedSentences": [
      "Space exploration has made amazing progress"
    ],
    "hints": [
      "Use present perfect for achievement",
      "Consider adjective before noun"
    ],
    "expectedKeywords": [
      "space",
      "exploration",
      "has",
      "made",
      "amazing",
      "progress"
    ]
  },
  {
    "id": "ex-199",
    "title": "Biodiversity Conservation",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss species protection",
    "sourceText": "Đa dạng sinh học đang bị đe dọa nghiêm trọng trên toàn cầu. Nhiều loài động thực vật đang đối mặt với nguy cơ tuyệt chủng. Phá rừng và ô nhiễm môi trường là nguyên nhân chính. Chúng ta cần thiết lập và bảo vệ các khu bảo tồn thiên nhiên. Chúng ta phải ngăn chặn săn bắt và buôn bán động vật hoang dã bất hợp pháp. Giáo dục cộng đồng về tầm quan trọng của đa dạng sinh học là cần thiết. Mỗi loài đều đóng vai trò quan trọng trong hệ sinh thái.",
    "highlightedSentences": [
      "Biodiversity is being seriously threatened globally"
    ],
    "hints": [
      "Use present continuous passive",
      "Consider adverb placement"
    ],
    "expectedKeywords": [
      "biodiversity",
      "is",
      "being",
      "seriously",
      "threatened",
      "globally"
    ]
  },
  {
    "id": "ex-200",
    "title": "Electric Vehicle Adoption",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss green transportation",
    "sourceText": "Xe điện đang ngày càng phổ biến trên toàn thế giới. Chúng không tạo ra khí thải trực tiếp và giảm ô nhiễm không khí. Công nghệ pin đang được cải thiện với phạm vi hoạt động xa hơn. Nhiều quốc gia đang xây dựng hạ tầng trạm sạc điện. Giá xe điện đang dần trở nên cạnh tranh hơn với xe xăng. Tuy nhiên, chúng ta cần đảm bảo điện sản xuất từ nguồn tái tạo. Xe điện là một phần quan trọng trong giải pháp giao thông bền vững.",
    "highlightedSentences": [
      "Electric vehicles are becoming increasingly popular worldwide"
    ],
    "hints": [
      "Use present continuous for trend",
      "Consider adverb 'increasingly'"
    ],
    "expectedKeywords": [
      "electric",
      "vehicles",
      "are",
      "becoming",
      "increasingly",
      "popular"
    ]
  },
  {
    "id": "ex-201",
    "title": "Ocean Pollution Crisis",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss marine environment",
    "sourceText": "Ô nhiễm đại dương đang trở thành một cuộc khủng hoảng toàn cầu. Hàng triệu tấn nhựa được đổ ra biển mỗi năm. Rác thải nhựa gây hại cho sinh vật biển và hệ sinh thái. Vi nhựa đã xâm nhập vào chuỗi thức ăn và ảnh hưởng đến sức khỏe con người. Chúng ta cần giảm sử dụng nhựa dùng một lần ngay lập tức. Chúng ta phải cải thiện hệ thống quản lý rác thải và tái chế. Bảo vệ đại dương là bảo vệ tương lai của chúng ta.",
    "highlightedSentences": [
      "Ocean pollution is becoming a global crisis"
    ],
    "hints": [
      "Use present continuous for developing situation",
      "Consider article before 'crisis'"
    ],
    "expectedKeywords": [
      "ocean",
      "pollution",
      "is",
      "becoming",
      "global",
      "crisis"
    ]
  },
  {
    "id": "ex-202",
    "title": "Genetic Engineering Ethics",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss biotechnology",
    "sourceText": "Kỹ thuật di truyền đang mở ra nhiều khả năng mới trong y học và nông nghiệp. Chúng ta có thể chỉnh sửa gen để chữa bệnh di truyền. Chúng ta có thể tạo ra cây trồng chống chịu sâu bệnh và hạn hán. Tuy nhiên, công nghệ này cũng đặt ra nhiều câu hỏi đạo đức phức tạp. Chúng ta cần cân nhắc kỹ lưỡng về hậu quả lâu dài. Chúng ta phải thiết lập quy định chặt chẽ để đảm bảo an toàn. Khoa học phải luôn đi đôi với trách nhiệm đạo đức.",
    "highlightedSentences": [
      "Genetic engineering is opening up new possibilities"
    ],
    "hints": [
      "Use present continuous for ongoing development",
      "Consider 'opening up' phrasal verb"
    ],
    "expectedKeywords": [
      "genetic",
      "engineering",
      "is",
      "opening",
      "up",
      "new",
      "possibilities"
    ]
  },
  {
    "id": "ex-203",
    "title": "Urban Green Spaces",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss city planning",
    "sourceText": "Không gian xanh trong thành phố đóng vai trò quan trọng cho sức khỏe cộng đồng. Công viên và vườn cây giúp cải thiện chất lượng không khí. Chúng cung cấp nơi thư giãn và tập thể dục cho người dân. Cây xanh giảm nhiệt độ và tạo bóng mát trong mùa hè. Không gian xanh cũng hỗ trợ đa dạng sinh học trong đô thị. Nhiều thành phố đang đầu tư vào việc tạo thêm công viên và vườn treo. Thiết kế đô thị bền vững phải ưu tiên không gian xanh.",
    "highlightedSentences": [
      "Green spaces in cities play an important role"
    ],
    "hints": [
      "Use present simple for general truth",
      "Consider article before 'role'"
    ],
    "expectedKeywords": [
      "green",
      "spaces",
      "in",
      "cities",
      "play",
      "important",
      "role"
    ]
  },
  {
    "id": "ex-204",
    "title": "Circular Economy Model",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss sustainable business",
    "sourceText": "Nền kinh tế tuần hoàn là mô hình thay thế cho nền kinh tế tuyến tính truyền thống. Thay vì sản xuất, sử dụng và vứt bỏ, chúng ta tái sử dụng và tái chế. Sản phẩm được thiết kế để dễ dàng sửa chữa và tái chế. Chất thải từ quá trình này trở thành nguyên liệu cho quá trình khác. Mô hình này giảm thiểu rác thải và tiết kiệm tài nguyên thiên nhiên. Nhiều doanh nghiệp đang chuyển đổi sang mô hình kinh tế tuần hoàn. Đây là chìa khóa cho sự phát triển bền vững.",
    "highlightedSentences": [
      "Circular economy is an alternative to the traditional linear economy"
    ],
    "hints": [
      "Use present simple for definition",
      "Consider article before 'alternative'"
    ],
    "expectedKeywords": [
      "circular",
      "economy",
      "is",
      "an",
      "alternative",
      "to",
      "traditional"
    ]
  },
  {
    "id": "ex-205",
    "title": "Smart City Technology",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss urban innovation",
    "sourceText": "Thành phố thông minh sử dụng công nghệ để cải thiện chất lượng cuộc sống. Cảm biến IoT thu thập dữ liệu về giao thông, năng lượng và môi trường. AI phân tích dữ liệu để tối ưu hóa dịch vụ công cộng. Đèn đường thông minh tiết kiệm năng lượng và tự động điều chỉnh độ sáng. Hệ thống giao thông thông minh giảm tắc nghẽn và ô nhiễm. Ứng dụng di động kết nối người dân với chính quyền. Công nghệ giúp thành phố trở nên hiệu quả và bền vững hơn.",
    "highlightedSentences": [
      "Smart cities use technology to improve quality of life"
    ],
    "hints": [
      "Use present simple for general practice",
      "Consider 'to' + infinitive"
    ],
    "expectedKeywords": [
      "smart",
      "cities",
      "use",
      "technology",
      "to",
      "improve",
      "quality"
    ]
  },
  {
    "id": "ex-206",
    "title": "Water Conservation Methods",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss water saving",
    "sourceText": "Bảo tồn nước ngọt đang trở nên cấp thiết hơn bao giờ hết. Nhiều khu vực trên thế giới đang đối mặt với tình trạng khan hiếm nước. Chúng ta cần sử dụng nước hiệu quả hơn trong nông nghiệp và công nghiệp. Công nghệ tưới nhỏ giọt giúp tiết kiệm nước trong canh tác. Thu gom nước mưa và tái sử dụng nước thải đã xử lý là giải pháp quan trọng. Mỗi người cũng có thể đóng góp bằng cách tiết kiệm nước hàng ngày. Nước là tài nguyên quý giá cần được bảo vệ.",
    "highlightedSentences": [
      "Freshwater conservation is becoming more urgent than ever"
    ],
    "hints": [
      "Use present continuous for increasing urgency",
      "Consider comparative structure"
    ],
    "expectedKeywords": [
      "freshwater",
      "conservation",
      "is",
      "becoming",
      "more",
      "urgent",
      "than",
      "ever"
    ]
  },
  {
    "id": "ex-207",
    "title": "Sustainable Agriculture",
    "level": "intermediate",
    "category": "science-environment",
    "description": "Discuss farming practices",
    "sourceText": "Nông nghiệp bền vững là chìa khóa để nuôi sống dân số ngày càng tăng. Canh tác hữu cơ không sử dụng hóa chất độc hại và bảo vệ đất. Luân canh cây trồng giúp duy trì độ phì nhiêu của đất. Nông nghiệp chính xác sử dụng công nghệ để tối ưu hóa sản xuất. Chúng ta cần giảm lãng phí thực phẩm trong toàn bộ chuỗi cung ứng. Hỗ trợ nông dân địa phương và thực phẩm theo mùa là quan trọng. Nông nghiệp bền vững bảo vệ môi trường và đảm bảo an ninh lương thực.",
    "highlightedSentences": [
      "Sustainable agriculture is key to feeding the growing population"
    ],
    "hints": [
      "Use present simple for general truth",
      "Consider 'key to' + gerund"
    ],
    "expectedKeywords": [
      "sustainable",
      "agriculture",
      "is",
      "key",
      "to",
      "feeding",
      "growing",
      "population"
    ]
  }
]
