[
  {
    "id": "ex-050",
    "title": "Sustainable Food Systems",
    "level": "advanced",
    "category": "daily-life",
    "description": "Examine agricultural challenges",
    "sourceText": "Hệ thống thực phẩm hiện tại của chúng ta hoàn toàn không bền vững. Nông nghiệp công nghiệp đang gây tổn hại nghiêm trọng cho môi trường. Nó tiêu thụ quá nhiều nước ngọt và hóa chất độc hại. Nó góp phần đáng kể vào biến đổi khí hậu toàn cầu. Nó làm suy giảm nghiêm trọng đa dạng sinh học. Đồng thời, hàng tỷ người trên thế giới vẫn đang chịu đói. Thực phẩm bị lãng phí một cách khủng khiếp ở các nước phát triển. Chúng ta cần chuyển đổi căn bản hệ thống thực phẩm. Chúng ta cần áp dụng các phương pháp nông nghiệp bền vững. Chúng ta cần giảm thiểu tối đa lãng phí thực phẩm. Chúng ta cần giảm tiêu thụ thịt đáng kể. Chúng ta cần hỗ trợ mạnh mẽ nông dân địa phương. Chúng ta cần đảm bảo an ninh lương thực cho toàn nhân loại. Tương lai của hệ thống thực phẩm phụ thuộc hoàn toàn vào những quyết định chúng ta đưa ra ngay hôm nay.",
    "englishText": "Our current food system is not sustainable. Industrial agriculture is causing serious environmental damage. It consumes too much fresh water and toxic chemicals. It contributes significantly to global climate change. It severely depletes biodiversity. Meanwhile, billions of people worldwide are still suffering from hunger. Food is wasted terribly in developed countries. We need to fundamentally transform the food system. We need to adopt sustainable farming methods. We need to minimize food waste. We need to significantly reduce meat consumption. We need to strongly support local farmers. We need to ensure food security for all humanity. The future of the food system depends entirely on the decisions we make today.",
    "highlightedSentences": [
      "Our current food system is not sustainable"
    ],
    "hints": [
      "Use 'is not' for negative statement",
      "Consider possessive adjective"
    ],
    "expectedKeywords": [
      "our",
      "current",
      "food",
      "system",
      "is",
      "not",
      "sustainable"
    ]
  },
  {
    "id": "ex-055",
    "title": "Work-Life Balance Philosophy",
    "level": "advanced",
    "category": "daily-life",
    "description": "Analyze modern lifestyle challenges",
    "sourceText": "Trong xã hội hiện đại, ranh giới giữa công việc và cuộc sống cá nhân ngày càng trở nên mờ nhạt. Công nghệ cho phép chúng ta làm việc mọi lúc mọi nơi, nhưng điều này cũng đồng nghĩa với việc chúng ta không bao giờ thực sự có thể 'ngắt kết nối'. Tôi đã phải học cách thiết lập những ranh giới rõ ràng và kiên quyết. Tôi tuyệt đối không kiểm tra email công việc sau 7 giờ tối. Tôi tắt thông báo công việc vào cuối tuần. Tôi dành thời gian chất lượng cho gia đình và bản thân. Sự cân bằng này giúp tôi duy trì năng suất và sức khỏe tinh thần.",
    "englishText": "In modern society, the boundary between work and personal life is becoming increasingly blurred. Technology allows us to work anytime, anywhere, but this also means we can never truly 'disconnect'. I had to learn to establish clear and firm boundaries. I absolutely do not check work emails after 7 PM. I turn off work notifications on weekends. I dedicate quality time to family and myself. This balance helps me maintain productivity and mental health.",
    "highlightedSentences": [
      "The boundary between work and personal life is becoming increasingly blurred"
    ],
    "hints": [
      "Use present continuous for ongoing change"
    ],
    "expectedKeywords": [
      "boundary",
      "between",
      "work",
      "personal",
      "life",
      "becoming",
      "blurred"
    ]
  },
  {
    "id": "ex-056",
    "title": "Minimalist Living Approach",
    "level": "advanced",
    "category": "daily-life",
    "description": "Explore lifestyle philosophy",
    "sourceText": "Chủ nghĩa tối giản không chỉ đơn thuần là về việc sở hữu ít đồ đạc hơn. Đó là về việc có ý thức tập trung vào những gì thực sự có ý nghĩa trong cuộc sống. Tôi đã bắt đầu áp dụng triết lý sống này vào đời thường của mình. Tôi dần loại bỏ những thứ không mang lại giá trị thực sự hoặc niềm vui bền vững. Tôi học cách từ chối những cam kết không cần thiết. Tôi đầu tư thời gian và năng lượng vào những mối quan hệ và trải nghiệm có ý nghĩa. Cuộc sống tối giản giúp tôi cảm thấy tự do và nhẹ nhàng hơn.",
    "englishText": "Minimalism is not just about owning fewer possessions. It's about consciously focusing on what truly matters in life. I started applying this philosophy to my daily life. I gradually eliminate things that don't bring real value or lasting joy. I learned to decline unnecessary commitments. I invest time and energy in meaningful relationships and experiences. Minimalist living helps me feel freer and lighter.",
    "highlightedSentences": [
      "Minimalism is not just about owning fewer possessions"
    ],
    "hints": [
      "Use 'is not just about' + gerund"
    ],
    "expectedKeywords": [
      "minimalism",
      "is",
      "not",
      "just",
      "about",
      "owning",
      "fewer"
    ]
  },
  {
    "id": "ex-057",
    "title": "Cultural Identity in Daily Life",
    "level": "advanced",
    "category": "daily-life",
    "description": "Reflect on cultural practices",
    "sourceText": "Cuộc sống ở nước ngoài đã khiến tôi trân trọng và đánh giá cao văn hóa bản địa của mình hơn bao giờ hết. Tôi nỗ lực duy trì các thói quen và truyền thống quý giá từ quê nhà. Tôi thường xuyên nấu các món ăn truyền thống Việt Nam, nghe nhạc quê hương, và tích cực tham gia các hoạt động của cộng đồng người Việt địa phương. Đồng thời, tôi cũng cởi mở học hỏi và tôn trọng văn hóa mới. Tôi tin rằng việc giữ gìn bản sắc văn hóa trong khi hòa nhập vào môi trường mới là chìa khóa để có một cuộc sống cân bằng và phong phú.",
    "englishText": "Living abroad has made me appreciate my native culture more than ever. I strive to maintain valuable habits and traditions from home. I regularly cook traditional Vietnamese dishes, listen to homeland music, and actively participate in local Vietnamese community activities. At the same time, I'm open to learning and respecting new cultures. I believe that preserving cultural identity while integrating into a new environment is the key to a balanced and enriched life.",
    "highlightedSentences": [
      "Living abroad has made me appreciate my culture more"
    ],
    "hints": [
      "Use present perfect for life experience impact"
    ],
    "expectedKeywords": [
      "living",
      "abroad",
      "has",
      "made",
      "appreciate",
      "culture",
      "more"
    ]
  },
  {
    "id": "ex-244",
    "title": "Digital Minimalism Practice",
    "level": "advanced",
    "category": "daily-life",
    "description": "Discuss technology boundaries",
    "sourceText": "Chủ nghĩa tối giản kỹ thuật số là phản ứng cần thiết trước sự quá tải thông tin hiện đại. Tôi đã nhận ra rằng việc liên tục kết nối với công nghệ đang làm suy giảm chất lượng cuộc sống của tôi. Tôi bắt đầu áp dụng các nguyên tắc nghiêm ngặt về sử dụng công nghệ. Tôi xóa bỏ các ứng dụng mạng xã hội không mang lại giá trị thực sự. Tôi thiết lập thời gian cụ thể để kiểm tra email và tin nhắn thay vì phản ứng liên tục. Tôi tạo ra các khoảng thời gian hoàn toàn không có thiết bị điện tử. Cách tiếp cận này đã giúp tôi lấy lại sự tập trung, cải thiện mối quan hệ và tăng cường sự hiện diện trong cuộc sống hàng ngày.",
    "englishText": "Digital minimalism is a necessary response to modern information overload. I realized that constantly being connected to technology was degrading my quality of life. I started applying strict principles about technology use. I removed social media apps that don't bring real value. I set specific times to check email and messages instead of constantly reacting. I create periods completely free of electronic devices. This approach has helped me regain focus, improve relationships and enhance presence in daily life.",
    "highlightedSentences": [
      "Digital minimalism is a necessary response to modern information overload"
    ],
    "hints": [
      "Use 'is' with singular subject",
      "Consider article before 'necessary response'"
    ],
    "expectedKeywords": [
      "digital",
      "minimalism",
      "is",
      "necessary",
      "response",
      "to",
      "modern",
      "information",
      "overload"
    ]
  },
  {
    "id": "ex-245",
    "title": "Intergenerational Living",
    "level": "advanced",
    "category": "daily-life",
    "description": "Explore family dynamics",
    "sourceText": "Mô hình sống đa thế hệ đang dần trở lại phổ biến trong xã hội hiện đại. Gia đình tôi đã quyết định sống chung với ông bà sau nhiều năm sống riêng. Quyết định này mang lại cả thách thức lẫn lợi ích đáng kể. Ông bà giúp chăm sóc cháu trong khi bố mẹ đi làm. Trẻ em được hưởng lợi từ sự khôn ngoan và kinh nghiệm của thế hệ lớn tuổi. Tuy nhiên, sự khác biệt về giá trị và lối sống đôi khi tạo ra xung đột. Chúng tôi phải học cách giao tiếp cởi mở, tôn trọng ranh giới cá nhân và thỏa hiệp. Mô hình này đòi hỏi sự kiên nhẫn, linh hoạt và cam kết từ tất cả các thành viên trong gia đình.",
    "englishText": "Multigenerational living is gradually becoming popular again in modern society. My family decided to live with grandparents after many years of living separately. This decision brings both challenges and significant benefits. Grandparents help care for grandchildren while parents work. Children benefit from the wisdom and experience of older generations. However, differences in values and lifestyles sometimes create conflicts. We must learn to communicate openly, respect personal boundaries and compromise. This model requires patience, flexibility and commitment from all family members.",
    "highlightedSentences": [
      "Multigenerational living is gradually becoming popular again in modern society"
    ],
    "hints": [
      "Use present continuous for trend",
      "Consider adverb 'gradually'"
    ],
    "expectedKeywords": [
      "multigenerational",
      "living",
      "is",
      "gradually",
      "becoming",
      "popular",
      "again"
    ]
  },
  {
    "id": "ex-246",
    "title": "Conscious Consumerism",
    "level": "advanced",
    "category": "daily-life",
    "description": "Discuss ethical purchasing",
    "sourceText": "Chủ nghĩa tiêu dùng có ý thức đòi hỏi chúng ta phải suy nghĩ kỹ lưỡng về mỗi quyết định mua sắm. Tôi đã chuyển từ việc mua sắm bốc đồng sang cân nhắc tác động của mỗi giao dịch mua. Tôi nghiên cứu về nguồn gốc sản phẩm, điều kiện lao động và tác động môi trường. Tôi ưu tiên các thương hiệu có trách nhiệm xã hội và môi trường. Tôi chọn chất lượng hơn số lượng, đầu tư vào sản phẩm bền vững lâu dài. Tôi hỗ trợ doanh nghiệp địa phương và sản xuất thủ công. Mặc dù cách tiếp cận này đôi khi tốn kém hơn, nó phù hợp với giá trị của tôi và đóng góp vào một nền kinh tế công bằng và bền vững hơn.",
    "englishText": "Conscious consumerism requires us to think carefully about each purchasing decision. I shifted from impulsive shopping to considering the impact of each purchase. I research product origins, labor conditions and environmental impact. I prioritize brands with social and environmental responsibility. I choose quality over quantity, investing in long-lasting sustainable products. I support local businesses and handmade production. Although this approach is sometimes more expensive, it aligns with my values and contributes to a fairer and more sustainable economy.",
    "highlightedSentences": [
      "Conscious consumerism requires us to think carefully about each purchasing decision"
    ],
    "hints": [
      "Use present simple for requirement",
      "Consider 'requires + object + to infinitive'"
    ],
    "expectedKeywords": [
      "conscious",
      "consumerism",
      "requires",
      "us",
      "to",
      "think",
      "carefully",
      "about",
      "each"
    ]
  },
  {
    "id": "ex-247",
    "title": "Urban vs Rural Living",
    "level": "advanced",
    "category": "daily-life",
    "description": "Compare lifestyle choices",
    "sourceText": "Cuộc tranh luận giữa cuộc sống thành thị và nông thôn phản ánh những ưu tiên và giá trị khác nhau của mỗi người. Sau nhiều năm sống ở thành phố lớn, tôi đã chuyển đến một thị trấn nhỏ ở vùng nông thôn. Thành phố mang lại cơ hội nghề nghiệp, tiện nghi hiện đại và sự đa dạng văn hóa. Tuy nhiên, nó cũng đi kèm với căng thẳng, ô nhiễm và chi phí sinh hoạt cao. Nông thôn cung cấp không gian, yên tĩnh và kết nối với thiên nhiên. Nhưng nó thiếu các dịch vụ, cơ hội việc làm và hoạt động văn hóa. Không có lựa chọn nào hoàn hảo tuyệt đối. Quyết định phụ thuộc vào giai đoạn cuộc đời, ưu tiên cá nhân và khả năng thích nghi của mỗi người.",
    "englishText": "The debate between urban and rural living reflects different priorities and values of each person. After many years living in a big city, I moved to a small town in the countryside. Cities offer career opportunities, modern amenities and cultural diversity. However, they also come with stress, pollution and high living costs. Rural areas provide space, tranquility and connection with nature. But they lack services, job opportunities and cultural activities. No choice is absolutely perfect. The decision depends on life stage, personal priorities and each person's adaptability.",
    "highlightedSentences": [
      "The debate between urban and rural living reflects different priorities and values"
    ],
    "hints": [
      "Use present simple for general truth",
      "Consider plural 'priorities and values'"
    ],
    "expectedKeywords": [
      "debate",
      "between",
      "urban",
      "and",
      "rural",
      "living",
      "reflects",
      "different",
      "priorities"
    ]
  },
  {
    "id": "ex-248",
    "title": "Lifelong Learning Philosophy",
    "level": "advanced",
    "category": "daily-life",
    "description": "Discuss continuous education",
    "sourceText": "Học tập suốt đời không chỉ là khẩu hiệu mà là điều kiện cần thiết để phát triển trong thế giới đang thay đổi nhanh chóng. Tôi đã cam kết dành ít nhất một giờ mỗi ngày cho việc học điều gì đó mới. Tôi đọc sách về nhiều lĩnh vực khác nhau, từ khoa học đến triết học. Tôi tham gia các khóa học trực tuyến để phát triển kỹ năng chuyên môn. Tôi lắng nghe podcast và tham dự hội thảo để mở rộng tầm nhìn. Tôi thực hành các kỹ năng mới thông qua dự án cá nhân. Học tập liên tục không chỉ giúp tôi duy trì khả năng cạnh tranh trong sự nghiệp mà còn làm phong phú cuộc sống và duy trì sự tò mò trí tuệ. Nó là khoản đầu tư tốt nhất tôi có thể làm cho bản thân.",
    "englishText": "Lifelong learning is not just a slogan but a necessary condition for thriving in a rapidly changing world. I've committed to spending at least one hour each day learning something new. I read books on various fields, from science to philosophy. I take online courses to develop professional skills. I listen to podcasts and attend seminars to broaden my perspective. I practice new skills through personal projects. Continuous learning not only helps me stay competitive in my career but also enriches life and maintains intellectual curiosity. It's the best investment I can make in myself.",
    "highlightedSentences": [
      "Lifelong learning is not just a slogan but a necessary condition for thriving"
    ],
    "hints": [
      "Use 'is not just...but' structure",
      "Consider article before 'necessary condition'"
    ],
    "expectedKeywords": [
      "lifelong",
      "learning",
      "is",
      "not",
      "just",
      "slogan",
      "but",
      "necessary",
      "condition"
    ]
  }
]
