[
  {
    "id": "ex-048",
    "title": "Entrepreneurship and Innovation",
    "level": "advanced",
    "category": "education-work",
    "description": "Explore business creation",
    "sourceText": "Khởi nghiệp chính là động lực cốt lõi của đổi mới kinh tế. Doanh nhân có tầm nhìn nhìn thấy cơ hội ở nơi người khác chỉ thấy vấn đề. Họ sẵn sàng chấp nhận rủi ro và bước ra khỏi vùng an toàn. Họ sáng tạo ra những sản phẩm và dịch vụ đột phá. Họ tạo ra hàng triệu việc làm và thúc đẩy tăng trưởng kinh tế. Tuy nhiên, con đường khởi nghiệp không hề dễ dàng. Thống kê cho thấy hầu hết các startup đều thất bại trong vài năm đầu. Doanh nhân phải đối mặt với vô vàn thách thức khó khăn. Họ cần nguồn vốn, kỹ năng chuyên môn và sự kiên trì phi thường. Họ phải liên tục thích nghi với những thay đổi của thị trường. Họ phải biết học hỏi từ mỗi thất bại. Thành công đòi hỏi cả tầm nhìn xa và khả năng thực thi mạnh mẽ. Nó đòi hỏi sự kết hợp hoàn hảo giữa sáng tạo và kỷ luật. Khởi nghiệp không chỉ đơn thuần về tiền bạc, mà còn về việc tạo ra giá trị thực sự và tác động tích cực đến xã hội.",
    "englishText": "Entrepreneurship is the engine of economic innovation. Visionary entrepreneurs see opportunities where others only see problems. They are willing to take risks and step out of their comfort zone. They create breakthrough products and services. They create millions of jobs and drive economic growth. However, the entrepreneurial path is not easy. Statistics show that most startups fail within the first few years. Entrepreneurs face countless difficult challenges. They need capital, expertise and extraordinary perseverance. They must constantly adapt to market changes. They must learn from each failure. Success requires both vision and strong execution ability. It requires a perfect combination of creativity and discipline. Entrepreneurship is not just about money, but about creating real value and positive impact on society.",
    "highlightedSentences": [
      "Entrepreneurship is the engine of economic innovation"
    ],
    "hints": [
      "Use 'is' with singular subject",
      "Consider the article before 'engine'"
    ],
    "expectedKeywords": [
      "entrepreneurship",
      "is",
      "the",
      "engine",
      "of",
      "economic",
      "innovation"
    ]
  },
  {
    "id": "ex-088",
    "title": "Remote Work Revolution",
    "level": "advanced",
    "category": "education-work",
    "description": "Analyze workplace transformation",
    "sourceText": "Làm việc từ xa đã trở thành xu hướng chủ đạo sau đại dịch COVID-19. Nhiều công ty bất ngờ nhận ra rằng nhân viên hoàn toàn có thể làm việc hiệu quả từ nhà. Điều này mang lại nhiều lợi ích đáng kể như tiết kiệm chi phí văn phòng, giảm thời gian đi lại và cải thiện đáng kể sự cân bằng giữa công việc và cuộc sống. Tuy nhiên, mô hình này cũng đặt ra không ít thách thức về giao tiếp nhóm, duy trì văn hóa công ty và thiết lập ranh giới rõ ràng giữa công việc và đời sống cá nhân. Tương lai của công việc có thể sẽ là mô hình hybrid linh hoạt, kết hợp hài hòa giữa làm việc từ xa và làm việc tại văn phòng.",
    "englishText": "Remote work has become a mainstream trend after the COVID-19 pandemic. Many companies surprisingly realized that employees can work effectively from home. This brings many significant benefits such as saving office costs, reducing commute time and significantly improving work-life balance. However, this model also poses many challenges regarding team communication, maintaining company culture and establishing clear boundaries between work and personal life. The future of work will likely be a flexible hybrid model, harmoniously combining remote work and office work.",
    "highlightedSentences": [
      "Remote work has become a mainstream trend after the pandemic"
    ],
    "hints": [
      "Use present perfect for recent change"
    ],
    "expectedKeywords": [
      "remote",
      "work",
      "has",
      "become",
      "mainstream",
      "trend",
      "after",
      "pandemic"
    ]
  },
  {
    "id": "ex-089",
    "title": "Lifelong Learning Necessity",
    "level": "advanced",
    "category": "education-work",
    "description": "Discuss continuous education",
    "sourceText": "Trong thế giới đang thay đổi với tốc độ chóng mặt, học tập suốt đời không còn là một lựa chọn mà đã trở thành điều tất yếu. Công nghệ và thị trường lao động đang phát triển và biến đổi không ngừng. Các kỹ năng mà hôm nay còn giá trị có thể trở nên lỗi thời chỉ trong vài năm. Chúng ta phải không ngừng cập nhật kiến thức và phát triển những kỹ năng mới. Các nền tảng học trực tuyến như Coursera, Udemy đã làm cho giáo dục chất lượng cao trở nên dễ tiếp cận hơn bao giờ hết. Đầu tư vào phát triển bản thân chính là chìa khóa vàng dẫn đến thành công bền vững trong sự nghiệp.",
    "englishText": "In a rapidly changing world, lifelong learning is no longer optional but necessary. Technology and the labor market are constantly developing and changing. Skills that are valuable today may become obsolete in just a few years. We must constantly update knowledge and develop new skills. Online learning platforms like Coursera and Udemy have made high-quality education more accessible than ever. Investing in personal development is the golden key to sustainable career success.",
    "highlightedSentences": [
      "In a rapidly changing world, lifelong learning is no longer optional but necessary"
    ],
    "hints": [
      "Use 'no longer...but' structure"
    ],
    "expectedKeywords": [
      "rapidly",
      "changing",
      "world",
      "lifelong",
      "learning",
      "is",
      "no",
      "longer",
      "optional",
      "but",
      "necessary"
    ]
  },
  {
    "id": "ex-090",
    "title": "Artificial Intelligence in Education",
    "level": "advanced",
    "category": "education-work",
    "description": "Explore AI in learning",
    "sourceText": "Trí tuệ nhân tạo đang thực sự cách mạng hóa ngành giáo dục. Các hệ thống AI tiên tiến có thể cá nhân hóa hoàn toàn trải nghiệm học tập cho từng học sinh cụ thể. Chúng có khả năng xác định chính xác điểm yếu và đề xuất tài liệu học tập phù hợp nhất. Giáo viên ảo và chatbot thông minh có thể cung cấp hỗ trợ học tập 24/7 không giới hạn. Tuy nhiên, chúng ta cũng phải nghiêm túc xem xét các vấn đề nhạy cảm về quyền riêng tư dữ liệu và vai trò không thể thay thế của giáo viên con người. AI nên được xem như công cụ bổ trợ đắc lực chứ không phải là thứ thay thế hoàn toàn giáo viên.",
    "englishText": "Artificial intelligence is revolutionizing education. Advanced AI systems can completely personalize the learning experience for each specific student. They can accurately identify weaknesses and suggest the most appropriate learning materials. Virtual teachers and smart chatbots can provide unlimited 24/7 learning support. However, we must also seriously consider sensitive issues about data privacy and the irreplaceable role of human teachers. AI should be seen as a powerful supplementary tool rather than a complete replacement for teachers.",
    "highlightedSentences": [
      "Artificial intelligence is revolutionizing education"
    ],
    "hints": [
      "Use present continuous for ongoing change"
    ],
    "expectedKeywords": [
      "artificial",
      "intelligence",
      "is",
      "revolutionizing",
      "education"
    ]
  },
  {
    "id": "ex-249",
    "title": "Future of Work Transformation",
    "level": "advanced",
    "category": "education-work",
    "description": "Analyze workforce evolution",
    "sourceText": "Tương lai của công việc đang được định hình lại bởi tự động hóa, trí tuệ nhân tạo và toàn cầu hóa. Nhiều công việc truyền thống đang biến mất trong khi các vai trò mới đang xuất hiện. Kỹ năng mềm như tư duy phản biện, sáng tạo và giao tiếp trở nên quan trọng hơn bao giờ hết. Khả năng thích nghi và học hỏi liên tục là yếu tố then chốt để tồn tại. Mô hình làm việc linh hoạt và từ xa đang trở thành chuẩn mực mới. Ranh giới giữa các ngành nghề đang mờ nhạt, đòi hỏi kỹ năng đa lĩnh vực. Chúng ta cần chuẩn bị cho một tương lai công việc không chắc chắn nhưng đầy cơ hội. Giáo dục và đào tạo phải thay đổi để đáp ứng nhu cầu mới này.",
    "englishText": "The future of work is being reshaped by automation, artificial intelligence and globalization. Many traditional jobs are disappearing while new roles are emerging. Soft skills like critical thinking, creativity and communication are becoming more important than ever. Adaptability and continuous learning are key factors for survival. Flexible and remote work models are becoming the new standard. Boundaries between industries are blurring, requiring multidisciplinary skills. We need to prepare for an uncertain but opportunity-filled work future. Education and training must change to meet these new demands.",
    "highlightedSentences": [
      "The future of work is being reshaped by automation, AI and globalization"
    ],
    "hints": [
      "Use present continuous passive",
      "Consider 'by' for agent"
    ],
    "expectedKeywords": [
      "future",
      "of",
      "work",
      "is",
      "being",
      "reshaped",
      "by",
      "automation",
      "AI",
      "globalization"
    ]
  }
]
