[
  {
    "id": "ex-043",
    "title": "The Psychology of Performance",
    "level": "advanced",
    "category": "health-wellness",
    "description": "Explore mental aspects of athletics",
    "sourceText": "Thành công trong thể thao không chỉ về thể chất. Sức mạnh tinh thần cũng quan trọng như vậy. Vận động viên phải đối phó với áp lực. Họ phải duy trì sự tập trung dưới căng thẳng. Họ phải vượt qua thất bại và thất vọng. Tâm lý học thể thao nghiên cứu những yếu tố này. Nó dạy các kỹ thuật hình dung. Nó giúp xây dựng sự tự tin. Nó cải thiện động lực. Nhiều vận động viên làm việc với nhà tâm lý học. Họ hiểu rằng tâm trí và cơ thể kết nối. Đào tạo tinh thần cũng quan trọng như đào tạo thể chất. Thái độ đúng đắn có thể tạo ra sự khác biệt giữa chiến thắng và thua cuộc.",
    "englishText": "Success in sports is not only about physical strength. Mental strength is equally important. Athletes must cope with pressure. They must maintain focus under stress. They must overcome failure and disappointment. Sports psychology studies these factors. It teaches visualization techniques. It helps build confidence. It improves motivation. Many athletes work with psychologists. They understand that mind and body are connected. Mental training is as important as physical training. The right attitude can make the difference between winning and losing.",
    "highlightedSentences": [
      "Success in sports is not only about physical strength"
    ],
    "hints": [
      "Use 'is not only about' structure",
      "Consider the adjective before 'strength'"
    ],
    "expectedKeywords": [
      "success",
      "in",
      "sports",
      "is",
      "not",
      "only",
      "about",
      "physical",
      "strength"
    ]
  },
  {
    "id": "ex-091",
    "title": "Mental Health Stigma",
    "level": "advanced",
    "category": "health-wellness",
    "description": "Discuss psychological health awareness",
    "sourceText": "Sự kỳ thị về sức khỏe tinh thần vẫn là một vấn đề nghiêm trọng trong nhiều xã hội. Nhiều người ngần ngại tìm kiếm sự giúp đỡ vì sợ bị phán xét. Điều này có thể dẫn đến hậu quả nghiêm trọng, bao gồm cả tự tử. Chúng ta cần thay đổi cách chúng ta nói về sức khỏe tinh thần. Giáo dục và nhận thức là chìa khóa để phá vỡ sự kỳ thị. Sức khỏe tinh thần nên được đối xử như sức khỏe thể chất.",
    "englishText": "Mental health stigma remains a serious problem in many societies. Many people hesitate to seek help because they fear being judged. This can lead to serious consequences, including suicide. We need to change how we talk about mental health. Education and awareness are key to breaking down stigma. Mental health should be treated like physical health.",
    "highlightedSentences": [
      "Mental health stigma remains a serious problem in many societies"
    ],
    "hints": [
      "Use present simple for current state"
    ],
    "expectedKeywords": [
      "mental",
      "health",
      "stigma",
      "remains",
      "serious",
      "problem",
      "in",
      "many",
      "societies"
    ]
  },
  {
    "id": "ex-092",
    "title": "Preventive Healthcare Approach",
    "level": "advanced",
    "category": "health-wellness",
    "description": "Analyze proactive health management",
    "sourceText": "Y học dự phòng tập trung vào việc ngăn ngừa bệnh tật thay vì chỉ điều trị chúng. Điều này bao gồm kiểm tra sức khỏe định kỳ, tiêm chủng và lối sống lành mạnh. Nghiên cứu cho thấy rằng đầu tư vào phòng ngừa tiết kiệm chi phí y tế dài hạn. Tuy nhiên, nhiều hệ thống y tế vẫn tập trung vào điều trị hơn là phòng ngừa. Chúng ta cần thay đổi tư duy này để cải thiện sức khỏe cộng đồng.",
    "englishText": "Preventive medicine focuses on preventing diseases rather than just treating them. This includes regular health checkups, vaccinations and healthy lifestyles. Research shows that investing in prevention saves long-term healthcare costs. However, many healthcare systems still focus on treatment rather than prevention. We need to change this mindset to improve community health.",
    "highlightedSentences": [
      "Preventive medicine focuses on preventing diseases rather than just treating them"
    ],
    "hints": [
      "Use 'focuses on' + gerund, 'rather than' for contrast"
    ],
    "expectedKeywords": [
      "preventive",
      "medicine",
      "focuses",
      "on",
      "preventing",
      "diseases",
      "rather",
      "than",
      "treating"
    ]
  },
  {
    "id": "ex-093",
    "title": "Aging Population Challenges",
    "level": "advanced",
    "category": "health-wellness",
    "description": "Examine demographic health issues",
    "sourceText": "Dân số già hóa đặt ra những thách thức lớn cho hệ thống y tế. Người cao tuổi thường có nhiều bệnh mãn tính và cần chăm sóc dài hạn. Chi phí y tế tăng cao trong khi lực lượng lao động giảm. Chúng ta cần phát triển các mô hình chăm sóc bền vững. Công nghệ như telehealth và thiết bị giám sát có thể giúp người cao tuổi sống độc lập lâu hơn. Xã hội cần chuẩn bị cho sự thay đổi nhân khẩu học này.",
    "englishText": "An aging population poses major challenges for healthcare systems. Elderly people often have many chronic diseases and need long-term care. Healthcare costs are rising while the workforce is shrinking. We need to develop sustainable care models. Technologies like telehealth and monitoring devices can help elderly people live independently longer. Society needs to prepare for this demographic change.",
    "highlightedSentences": [
      "An aging population poses major challenges for healthcare systems"
    ],
    "hints": [
      "Use present simple for general truth"
    ],
    "expectedKeywords": [
      "aging",
      "population",
      "poses",
      "major",
      "challenges",
      "for",
      "healthcare",
      "systems"
    ]
  }
]
