[
  {
    "id": "ex-038",
    "title": "Climate Change Challenge",
    "level": "advanced",
    "category": "science-environment",
    "description": "Analyze environmental crisis",
    "sourceText": "Biến đổi khí hậu là thách thức lớn nhất của thời đại chúng ta. Nhiệt độ toàn cầu đang tăng. Băng ở cực đang tan chảy. Mực nước biển đang dâng cao. Thời tiết cực đoan trở nên thường xuyên hơn. Các loài động thực vật đang tuyệt chủng. Nguyên nhân chính là hoạt động của con người. Chúng ta đốt nhiên liệu hóa thạch. Chúng ta phá rừng. Chúng ta sản xuất quá nhiều chất thải. Chúng ta cần hành động ngay bây giờ. Chúng ta phải chuyển sang năng lượng tái tạo. Chúng ta phải thay đổi lối sống. Tương lai của hành tinh phụ thuộc vào chúng ta.",
    "englishText": "Climate change is the greatest challenge of our time. Global temperatures are rising. Polar ice is melting. Sea levels are rising. Extreme weather is becoming more frequent. Plant and animal species are going extinct. The main cause is human activity. We burn fossil fuels. We deforest. We produce too much waste. We need to act now. We must switch to renewable energy. We must change our lifestyles. The future of the planet depends on us.",
    "highlightedSentences": [
      "Climate change is the greatest challenge of our time"
    ],
    "hints": [
      "Use 'is' with singular subject",
      "Consider the superlative form and possessive"
    ],
    "expectedKeywords": [
      "climate",
      "change",
      "is",
      "the",
      "greatest",
      "challenge",
      "of",
      "our",
      "time"
    ]
  },
  {
    "id": "ex-039",
    "title": "Artificial Intelligence Ethics",
    "level": "advanced",
    "category": "science-environment",
    "description": "Debate AI implications",
    "sourceText": "Trí tuệ nhân tạo đang phát triển với tốc độ chưa từng có. AI có thể thực hiện nhiều nhiệm vụ tốt hơn con người. Nó có thể chẩn đoán bệnh, lái xe, và viết văn bản. Tuy nhiên, AI cũng đặt ra những câu hỏi đạo đức nghiêm trọng. Ai chịu trách nhiệm khi AI mắc lỗi? AI có thể có định kiến không? Liệu AI sẽ thay thế công việc của con người? Chúng ta cần phát triển AI một cách có trách nhiệm. Chúng ta phải đảm bảo AI phục vụ nhân loại. Chúng ta cần quy định và giám sát. Tương lai của AI phụ thuộc vào những quyết định chúng ta đưa ra hôm nay.",
    "englishText": "Artificial intelligence is developing at an unprecedented rate. AI can perform many tasks better than humans. It can diagnose diseases, drive cars, and write text. However, AI also raises serious ethical questions. Who is responsible when AI makes mistakes? Can AI be biased? Will AI replace human jobs? We need to develop AI responsibly. We must ensure AI serves humanity. We need regulation and oversight. The future of AI depends on the decisions we make today.",
    "highlightedSentences": [
      "Artificial intelligence is developing at an unprecedented rate"
    ],
    "hints": [
      "Use present continuous for ongoing development",
      "Consider the preposition before 'unprecedented rate'"
    ],
    "expectedKeywords": [
      "artificial",
      "intelligence",
      "is",
      "developing",
      "at",
      "an",
      "unprecedented",
      "rate"
    ]
  },
  {
    "id": "ex-099",
    "title": "Gene Editing Ethics",
    "level": "advanced",
    "category": "science-environment",
    "description": "Debate biotechnology morality",
    "sourceText": "Chỉnh sửa gen CRISPR đã mở ra khả năng điều trị các bệnh di truyền. Chúng ta có thể loại bỏ các gen gây bệnh và thậm chí cải thiện đặc điểm con người. Tuy nhiên, công nghệ này đặt ra những câu hỏi đạo đức nghiêm trọng. Liệu chúng ta có nên 'thiết kế' trẻ em không? Ai quyết định những đặc điểm nào là mong muốn? Công nghệ này có thể tạo ra bất bình đẳng mới giữa những người có thể chi trả và không thể. Chúng ta cần quy định cẩn thận về chỉnh sửa gen.",
    "englishText": "CRISPR gene editing has opened up the possibility of treating genetic diseases. We can remove disease-causing genes and even enhance human traits. However, this technology raises serious ethical questions. Should we 'design' babies? Who decides which traits are desirable? This technology could create new inequality between those who can afford it and those who cannot. We need careful regulation of gene editing.",
    "highlightedSentences": [
      "CRISPR gene editing has opened up the possibility of treating genetic diseases"
    ],
    "hints": [
      "Use present perfect for recent capability"
    ],
    "expectedKeywords": [
      "CRISPR",
      "gene",
      "editing",
      "has",
      "opened",
      "up",
      "possibility",
      "of",
      "treating",
      "genetic",
      "diseases"
    ]
  },
  {
    "id": "ex-100",
    "title": "Ocean Plastic Crisis",
    "level": "advanced",
    "category": "science-environment",
    "description": "Analyze marine pollution",
    "sourceText": "Ô nhiễm nhựa đại dương đã đạt đến mức khủng hoảng. Hàng triệu tấn nhựa đổ vào đại dương mỗi năm. Vi nhựa được tìm thấy trong cá và thậm chí trong cơ thể con người. Động vật biển bị mắc kẹt trong rác thải nhựa hoặc ăn phải chúng. Các vùng rác thải khổng lồ nổi trên đại dương. Chúng ta cần giảm sử dụng nhựa một lần, cải thiện quản lý rác thải và phát triển vật liệu thay thế. Giải quyết vấn đề này đòi hỏi hành động toàn cầu.",
    "englishText": "Ocean plastic pollution has reached crisis levels. Millions of tons of plastic pour into the ocean every year. Microplastics are found in fish and even in human bodies. Marine animals get trapped in plastic waste or ingest it. Giant garbage patches float in the ocean. We need to reduce single-use plastic, improve waste management and develop alternative materials. Solving this problem requires global action.",
    "highlightedSentences": [
      "Ocean plastic pollution has reached crisis levels"
    ],
    "hints": [
      "Use present perfect for current state resulting from past actions"
    ],
    "expectedKeywords": [
      "ocean",
      "plastic",
      "pollution",
      "has",
      "reached",
      "crisis",
      "levels"
    ]
  }
]
