[
  {
    "id": "ex-084",
    "title": "Sustainable Tourism Impact",
    "level": "advanced",
    "category": "travel-transportation",
    "description": "Analyze tourism ethics",
    "sourceText": "Du lịch bền vững đã trở thành một chủ đề nóng hổi và cấp thiết trong ngành du lịch toàn cầu. Du lịch đại chúng không kiểm soát có thể gây tổn hại nghiêm trọng cho môi trường tự nhiên và văn hóa bản địa. Nhiều điểm đến nổi tiếng đang bị quá tải nghiêm trọng với lượng khách du lịch khổng lồ. Cư dân địa phương phải chịu đựng giá cả sinh hoạt tăng vọt và mất dần không gian sống của mình. Chúng ta cần khẩn trương phát triển các mô hình du lịch có trách nhiệm và bền vững hơn. Điều này bao gồm việc giới hạn hợp lý số lượng khách, bảo tồn nghiêm ngặt di sản văn hóa, và đảm bảo lợi ích công bằng cho cộng đồng địa phương. Du lịch phải mang lại lợi ích cho cả du khách và người dân bản địa.",
    "highlightedSentences": [
      "Sustainable tourism has become an important topic in the travel industry"
    ],
    "hints": [
      "Use present perfect for recent development"
    ],
    "expectedKeywords": [
      "sustainable",
      "tourism",
      "has",
      "become",
      "important",
      "topic",
      "in",
      "travel",
      "industry"
    ]
  },
  {
    "id": "ex-085",
    "title": "Future of Transportation",
    "level": "advanced",
    "category": "travel-transportation",
    "description": "Explore mobility innovation",
    "sourceText": "Tương lai của giao thông vận tải đang được định hình bởi những công nghệ đột phá. Xe tự lái hứa hẹn giảm đáng kể tai nạn giao thông và tình trạng tắc nghẽn. Xe điện đang dần thay thế hoàn toàn động cơ đốt trong truyền thống. Hyperloop và các công nghệ vận tải siêu tốc khác đang được nghiên cứu và phát triển mạnh mẽ. Tuy nhiên, những tiến bộ công nghệ này cũng đặt ra nhiều câu hỏi quan trọng về việc làm, an ninh mạng và bất bình đẳng trong khả năng tiếp cận. Chúng ta cần cân nhắc thật kỹ lưỡng cả lợi ích tiềm năng lẫn rủi ro của những đổi mới này. Sự chuyển đổi phải diễn ra một cách công bằng và có trách nhiệm.",
    "highlightedSentences": [
      "The future of transportation is being shaped by new technologies"
    ],
    "hints": [
      "Use present continuous passive for ongoing process"
    ],
    "expectedKeywords": [
      "future",
      "of",
      "transportation",
      "is",
      "being",
      "shaped",
      "by",
      "new",
      "technologies"
    ]
  },
  {
    "id": "ex-086",
    "title": "Nomadic Lifestyle Challenges",
    "level": "advanced",
    "category": "travel-transportation",
    "description": "Examine digital nomad life",
    "sourceText": "Lối sống du mục kỹ thuật số (digital nomad) đang ngày càng trở nên phổ biến trên toàn thế giới. Ngày càng nhiều người chọn làm việc từ xa trong khi du lịch và khám phá khắp các châu lục. Điều này mang lại sự tự do tuyệt đối và những trải nghiệm văn hóa vô cùng phong phú. Tuy nhiên, lối sống này cũng đi kèm với những thách thức không nhỏ. Duy trì các mối quan hệ cá nhân ổn định và sâu sắc là vô cùng khó khăn. Sự chênh lệch múi giờ thường xuyên ảnh hưởng tiêu cực đến công việc và sức khỏe. Các vấn đề về visa, thuế và pháp lý có thể cực kỳ phức tạp. Việc thiếu một nơi thực sự gọi là nhà có thể gây ra cảm giác cô đơn và lạc lõng sâu sắc. Lối sống du mục kỹ thuật số đòi hỏi khả năng thích nghi linh hoạt và sức bền tinh thần cao độ.",
    "highlightedSentences": [
      "The digital nomad lifestyle is becoming more popular"
    ],
    "hints": [
      "Use present continuous for ongoing trend"
    ],
    "expectedKeywords": [
      "digital",
      "nomad",
      "lifestyle",
      "is",
      "becoming",
      "more",
      "popular"
    ]
  },
  {
    "id": "ex-087",
    "title": "Aviation Industry Evolution",
    "level": "advanced",
    "category": "travel-transportation",
    "description": "Analyze air travel changes",
    "sourceText": "Ngành hàng không đã trải qua những biến đổi sâu sắc trong thập kỷ qua. Các hãng hàng không giá rẻ đã thực sự dân chủ hóa du lịch hàng không, giúp hàng triệu người có cơ hội bay lần đầu. Công nghệ mới liên tục cải thiện hiệu quả sử dụng nhiên liệu và giảm thiểu khí thải độc hại. Tuy nhiên, ngành này cũng đang đối mặt với những thách thức chưa từng có. Đại dịch COVID-19 đã tàn phá tài chính của hầu hết các hãng hàng không. Mối lo ngại ngày càng tăng về biến đổi khí hậu đang thúc đẩy phong trào kêu gọi giảm thiểu bay máy bay. Ngành hàng không đang phải vật lộn để tìm sự cân bằng giữa tăng trưởng kinh tế và trách nhiệm bảo vệ môi trường. Tương lai của ngành phụ thuộc vào khả năng đổi mới bền vững.",
    "highlightedSentences": [
      "The aviation industry has undergone major changes in the past decade"
    ],
    "hints": [
      "Use present perfect for change over time period"
    ],
    "expectedKeywords": [
      "aviation",
      "industry",
      "has",
      "undergone",
      "major",
      "changes",
      "in",
      "past",
      "decade"
    ]
  }
]
