[
  {
    "id": "ex-019",
    "title": "Understanding Democracy",
    "level": "beginner",
    "category": "philosophy-beliefs",
    "description": "Learn about civic participation",
    "sourceText": "Hôm nay tôi đi bỏ phiếu lần đầu tiên trong đời. Tôi cảm thấy rất tự hào. Đây vừa là quyền lợi vừa là trách nhiệm của tôi. Tôi đã tìm hiểu kỹ về các ứng cử viên. Tôi chọn người mà tôi tin tưởng nhất. Bỏ phiếu là cách để tiếng nói của tôi được lắng nghe. Tôi hy vọng sự lựa chọn của mình sẽ góp phần tạo ra những thay đổi tích cực.",
    "englishText": "Today I vote for the first time in my life. I feel very proud. This is both my right and my responsibility. I have researched the candidates carefully. I choose the person I trust the most. Voting is a way for my voice to be heard. I hope my choice will contribute to positive changes.",
    "highlightedSentences": [
      "Today I vote for the first time"
    ],
    "hints": [
      "Use present tense for current action",
      "Consider the correct preposition"
    ],
    "expectedKeywords": [
      "today",
      "vote",
      "first",
      "time"
    ]
  },
  {
    "id": "ex-020",
    "title": "A Journey Through History",
    "level": "beginner",
    "category": "philosophy-beliefs",
    "description": "Visit a historical site",
    "sourceText": "Tôi đến thăm một di tích lịch sử. Nơi đây rất cổ kính và trang nghiêm. Tôi thấy những bức tường đá cũ kỹ. Hướng dẫn viên kể về lịch sử lâu đời của nơi này. Tôi học được rất nhiều điều mới mẻ. Tôi chụp nhiều bức ảnh làm kỷ niệm. Tôi cảm thấy được kết nối với quá khứ. Đây thực sự là một trải nghiệm giáo dục ý nghĩa.",
    "englishText": "I visit a historical site. This place is very ancient and solemn. I see old stone walls. The guide tells about the long history of this place. I learn many new things. I take many photos as souvenirs. I feel connected to the past. This is truly a meaningful educational experience.",
    "highlightedSentences": [
      "I visit a historical site"
    ],
    "hints": [
      "Use present tense for current visit",
      "Consider the article before 'historical site'"
    ],
    "expectedKeywords": [
      "visit",
      "a",
      "historical",
      "site"
    ]
  },
  {
    "id": "ex-023",
    "title": "Finding Inner Peace",
    "level": "beginner",
    "category": "philosophy-beliefs",
    "description": "Reflect on spiritual practice",
    "sourceText": "Mỗi sáng tôi dành thời gian để thiền định. Tôi ngồi yên lặng và tập trung vào hơi thở của mình. Tôi cảm thấy bình an sâu thẳm trong tâm hồn. Thiền giúp tôi giảm bớt căng thẳng rất nhiều. Tôi trở nên tỉnh táo và minh mẫn hơn. Tôi có thể đối mặt với thử thách tốt hơn. Đây là thói quen vô cùng quan trọng trong cuộc sống của tôi.",
    "englishText": "Every morning I spend time meditating. I sit quietly and focus on my breathing. I feel deep peace in my soul. Meditation helps me reduce stress a lot. I become more alert and clear-minded. I can face challenges better. This is a very important habit in my life.",
    "highlightedSentences": [
      "Every morning I spend time meditating"
    ],
    "hints": [
      "Use present simple for daily routine",
      "Consider the gerund form after 'spend time'"
    ],
    "expectedKeywords": [
      "every",
      "morning",
      "spend",
      "time",
      "meditating"
    ]
  },
  {
    "id": "ex-024",
    "title": "Understanding My Rights",
    "level": "beginner",
    "category": "philosophy-beliefs",
    "description": "Learn about legal rights",
    "sourceText": "Hôm nay tôi học về quyền công dân. Tôi có quyền tự do ngôn luận và bày tỏ ý kiến. Tôi có quyền được tiếp cận giáo dục. Tôi có quyền được pháp luật bảo vệ. Những quyền này vô cùng quan trọng. Tôi cũng có trách nhiệm tôn trọng quyền của người khác. Hiểu biết về quyền lợi giúp tôi trở thành một công dân có trách nhiệm hơn.",
    "englishText": "Today I learn about civil rights. I have the right to freedom of speech and expression. I have the right to access education. I have the right to be protected by law. These rights are extremely important. I also have the responsibility to respect others' rights. Understanding rights helps me become a more responsible citizen.",
    "highlightedSentences": [
      "I have the right to freedom of speech"
    ],
    "hints": [
      "Use 'have the right to' structure",
      "Consider the correct noun form"
    ],
    "expectedKeywords": [
      "have",
      "right",
      "to",
      "freedom",
      "speech"
    ]
  },
  {
    "id": "ex-025",
    "title": "Making Ethical Choices",
    "level": "beginner",
    "category": "philosophy-beliefs",
    "description": "Reflect on moral decisions",
    "sourceText": "Tôi luôn cố gắng làm điều đúng đắn. Đôi khi thật khó để biết điều gì là đúng. Tôi suy nghĩ kỹ về hậu quả của mỗi hành động. Tôi tự hỏi bản thân: Điều này có làm tổn thương ai không? Tôi cố gắng sống trung thực và tử tế với mọi người. Tôi tin rằng những lựa chọn nhỏ hàng ngày tạo nên con người chúng ta. Đạo đức chính là la bàn dẫn đường cho cuộc đời tôi.",
    "englishText": "I always try to do the right thing. Sometimes it is hard to know what is right. I think carefully about the consequences of each action. I ask myself: Will this hurt anyone? I try to live honestly and kindly with everyone. I believe that small daily choices make us who we are. Ethics is the compass that guides my life.",
    "highlightedSentences": [
      "I always try to do the right thing"
    ],
    "hints": [
      "Use 'try to' with infinitive",
      "Consider the correct article"
    ],
    "expectedKeywords": [
      "always",
      "try",
      "to",
      "do",
      "right",
      "thing"
    ]
  },
  {
    "id": "ex-158",
    "title": "Respecting Elders",
    "level": "beginner",
    "category": "philosophy-beliefs",
    "description": "Discuss cultural values",
    "sourceText": "Trong văn hóa Việt Nam, chúng tôi tôn trọng người lớn tuổi. Tôi luôn chào hỏi ông bà và người già. Tôi nhường ghế cho người cao tuổi trên xe buýt. Tôi lắng nghe lời khuyên của họ. Người già có nhiều kinh nghiệm và trí tuệ. Tôn trọng người lớn tuổi là truyền thống tốt đẹp. Tôi dạy con tôi giá trị này.",
    "englishText": "In Vietnamese culture, we respect elderly people. I always greet grandparents and old people. I give my seat to elderly people on the bus. I listen to their advice. Elderly people have much experience and wisdom. Respecting elders is a beautiful tradition. I teach my children this value.",
    "highlightedSentences": [
      "We respect elderly people in Vietnamese culture"
    ],
    "hints": [
      "Use present simple for cultural practice",
      "Consider preposition with 'culture'"
    ],
    "expectedKeywords": [
      "respect",
      "elderly",
      "people",
      "in",
      "Vietnamese",
      "culture"
    ]
  },
  {
    "id": "ex-159",
    "title": "Being Honest",
    "level": "beginner",
    "category": "philosophy-beliefs",
    "description": "Discuss honesty value",
    "sourceText": "Tôi tin rằng trung thực rất quan trọng. Tôi luôn nói sự thật. Đôi khi nói thật khó khăn nhưng đó là điều đúng. Tôi không nói dối bố mẹ và bạn bè. Trung thực xây dựng lòng tin. Mọi người tin tưởng tôi. Tôi cảm thấy tự hào về bản thân.",
    "englishText": "I believe that honesty is very important. I always tell the truth. Sometimes telling the truth is difficult but it is the right thing. I don't lie to my parents and friends. Honesty builds trust. People trust me. I feel proud of myself.",
    "highlightedSentences": [
      "I believe that honesty is very important"
    ],
    "hints": [
      "Use 'believe that' clause",
      "Consider 'is' with singular subject"
    ],
    "expectedKeywords": [
      "believe",
      "that",
      "honesty",
      "is",
      "very",
      "important"
    ]
  },
  {
    "id": "ex-160",
    "title": "Helping Others",
    "level": "beginner",
    "category": "philosophy-beliefs",
    "description": "Discuss kindness",
    "sourceText": "Tôi thích giúp đỡ người khác. Tôi giúp bạn làm bài tập. Tôi giúp mẹ làm việc nhà. Tôi giúp người già qua đường. Giúp đỡ người khác khiến tôi vui. Tôi tin rằng lòng tốt lan tỏa. Một hành động nhỏ có thể thay đổi ngày của ai đó.",
    "englishText": "I like helping other people. I help friends with homework. I help my mother with housework. I help elderly people cross the street. Helping others makes me happy. I believe that kindness spreads. A small action can change someone's day.",
    "highlightedSentences": [
      "I like helping other people"
    ],
    "hints": [
      "Use 'like' + gerund",
      "Consider adjective 'other'"
    ],
    "expectedKeywords": [
      "like",
      "helping",
      "other",
      "people"
    ]
  },
  {
    "id": "ex-161",
    "title": "Family Values",
    "level": "beginner",
    "category": "philosophy-beliefs",
    "description": "Discuss family importance",
    "sourceText": "Gia đình là điều quan trọng nhất với tôi. Tôi yêu bố mẹ và anh em. Chúng tôi luôn ở bên nhau. Chúng tôi chia sẻ vui buồn. Gia đình hỗ trợ tôi trong mọi hoàn cảnh. Tôi biết ơn gia đình mình. Tôi sẽ luôn chăm sóc họ.",
    "englishText": "Family is the most important thing to me. I love my parents and siblings. We are always together. We share joys and sorrows. Family supports me in all situations. I am grateful for my family. I will always take care of them.",
    "highlightedSentences": [
      "Family is the most important thing to me"
    ],
    "hints": [
      "Use 'is' with singular subject",
      "Consider superlative form"
    ],
    "expectedKeywords": [
      "family",
      "is",
      "most",
      "important",
      "thing",
      "to",
      "me"
    ]
  },
  {
    "id": "ex-162",
    "title": "Learning from Mistakes",
    "level": "beginner",
    "category": "philosophy-beliefs",
    "description": "Reflect on personal growth",
    "sourceText": "Mọi người đều mắc lỗi. Tôi cũng thường mắc lỗi. Nhưng tôi học hỏi từ sai lầm. Tôi không lặp lại lỗi cũ. Sai lầm giúp tôi trưởng thành. Tôi không sợ thất bại. Thất bại là cơ hội để học hỏi. Tôi trở nên mạnh mẽ hơn.",
    "englishText": "Everyone makes mistakes. I also often make mistakes. But I learn from mistakes. I don't repeat old mistakes. Mistakes help me grow. I am not afraid of failure. Failure is an opportunity to learn. I become stronger.",
    "highlightedSentences": [
      "Everyone makes mistakes"
    ],
    "hints": [
      "Use present simple for general truth",
      "Consider plural verb"
    ],
    "expectedKeywords": [
      "everyone",
      "makes",
      "mistakes"
    ]
  }
]
